Autodesk.Revit.DB.ElementComparerByParameterData.#ctor(Autodesk.Revit.DB.ElementId)
Constructor to instantiate a data with the given parameter Id and default sorting order.
Remarks:
Use the Order property to change the direction of sorting order as desired.
parameterId:
Id of the parameter used for comparison
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015